# Planning Stage: Data Description & Exploratory Data Analysis and Visualization

In [22]:
# libraries needed in this analysis

library(tidyverse)
library(repr)
library(broom)

## 1. Data Description

We begin by downloading and reading the "Data Science Job Salaries" dataset from Kaggle. 

> https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries

In [25]:
data <- read_csv("data/ds_salaries.csv", col_names = TRUE, show_col_types = FALSE)
data <- data[, -1] # remove the first column
head(data, n = 15)

New names:
• `` -> `...1`

   work_year experience_level employment_type job_title
1  2020      MI               FT              Data Scientist
2  2020      SE               FT              Machine Learning Scientist
3  2020      SE               FT              Big Data Engineer
4  2020      MI               FT              Product Data Analyst
5  2020      SE               FT              Machine Learning Engineer
6  2020      EN               FT              Data Analyst
7  2020      SE               FT              Lead Data Scientist
8  2020      MI               FT              Data Scientist
9  2020      MI               FT              Business Data Analyst
10 2020      SE               FT              Lead Data Engineer
11 2020      EN               FT              Data Scientist
12 2020      MI               FT              Data Scientist
13 2020      EN               FT              Data Scientist
14 2020      MI               FT              Lead Data Analyst
15 2020      MI               FT              Data Analyst
   salary   salary_currency salary_in_usd employee_residence remote_ratio
1     70000 EUR              79833        DE                   0
2    260000 USD             260000        JP                   0
3     85000 GBP             109024        GB                  50
4     20000 USD              20000        HN                   0
5    150000 USD             150000        US                  50
6     72000 USD              72000        US                 100
7    190000 USD             190000        US                 100
8  11000000 HUF              35735        HU                  50
9    135000 USD             135000        US                 100
10   125000 USD             125000        NZ                  50
11    45000 EUR              51321        FR                   0
12  3000000 INR              40481        IN                   0
13    35000 EUR              39916        FR                   0
14    87000 USD              87000        US                 100
15    85000 USD              85000        US                 100
   company_location company_size
1  DE               L
2  JP               S
3  GB               M
4  HN               S
5  US               L
6  US               L
7  US               S
8  HU               L
9  US               L
10 NZ               S
11 FR               S
12 IN               L
13 FR               M
14 US               L
15 US               L